#+TITLE: Building Qemu-Kvm Images With Packer (Part I)
#+SUBTITLE: Building Rocky Linux 9 VM Images with Packer
#+AUTHOR: Zakaria.K
#+EMAIL: 4.kebairia@gmail.com
#+DATE: 11 April 2023
#+STARTUP: show2levels indent hidestars
#+TAGS: packer,linux
#+OPTIONS: html5-fancy:t tex:t
#+PROPERTY: header-args:sh :results output :exports both 
#+begin_date
Date: {{{date}}}
#+end_date
* Installing Packer

Installing Packer is a straightforward process. Simply visit the [[https://developer.hashicorp.com/packer/downloads][official documentation]], where you can find the appropriate version of Packer for your operating system.\\
I'm using Arch Linux, and Packer is already available in the Arch repos.\\

We will install =qemu-ui-gtk= as well, this will enable us to easily monitor Packer's installation of the operating system through a graphical user interface.

#+begin_src sh
sudo pacman -S packer qemu-ui-gtk --noconfirm
packer --version
#+end_src

#+RESULTS:
#+begin_example
1.8.6
#+end_example

* Building the image
Let's first validate our template.
#+begin_src sh
packer validate .
#+end_src

#+RESULTS:
: The configuration is valid.

And then build.
#+begin_src sh :results none
export PACKER_LOG=1 && packer build .
#+end_src

#+html: <details><summary>Packer building process -- output </summary>
#+begin_example
2023/04/11 20:13:04 [INFO] Packer version: 1.8.6 [go1.20.1 linux amd64]
2023/04/11 20:13:04 Detected xdg config directory from env var: /home/zakaria/.config
2023/04/11 20:13:04 [TRACE] discovering plugins in /usr/bin
2023/04/11 20:13:04 Detected xdg config directory from env var: /home/zakaria/.config
2023/04/11 20:13:04 [TRACE] discovering plugins in /home/zakaria/.config/packer/plugins
2023/04/11 20:13:04 [DEBUG] Discovered plugin: qemu = /home/zakaria/.config/packer/plugins/github.com/hashicorp/qemu/packer-plugin-qemu_v1.0.9_x5.0_linux_amd64
2023/04/11 20:13:04 [INFO] found external [-packer-default-plugin-name-] builders from qemu plugin
2023/04/11 20:13:04 [TRACE] discovering plugins in .
2023/04/11 20:13:04 [INFO] PACKER_CONFIG env var not set; checking the default config file path
2023/04/11 20:13:04 [INFO] PACKER_CONFIG env var set; attempting to open config file: /home/zakaria/.packerconfig
2023/04/11 20:13:04 [WARN] Config file doesn't exist: /home/zakaria/.packerconfig
2023/04/11 20:13:04 Detected xdg config directory from env var: /home/zakaria/.config
2023/04/11 20:13:04 [INFO] Setting cache directory: /home/zakaria/.cache/packer
2023/04/11 20:13:04 Detected xdg config directory from env var: /home/zakaria/.config
2023/04/11 20:13:04 [TRACE] listing potential installations for "github.com/hashicorp/qemu" that match " >= 1.0.9". plugingetter.ListInstallationsOptions{FromFolders:[]string{"/usr/bin/packer", ".", "/home/zakaria/.config/packer/plugins"}, BinaryInstallationOptions:plugingetter.BinaryInstallationOptions{APIVersionMajor:"5", APIVersionMinor:"0", OS:"linux", ARCH:"amd64", Ext:"", Checksummers:[]plugingetter.Checksummer{plugingetter.Checksummer{Type:"sha256", Hash:(*sha256.digest)(0xc000a92200)}}}}
2023/04/11 20:13:04 [TRACE] Found the following "github.com/hashicorp/qemu" installations: [{/home/zakaria/.config/packer/plugins/github.com/hashicorp/qemu/packer-plugin-qemu_v1.0.9_x5.0_linux_amd64 v1.0.9}]
2023/04/11 20:13:04 [INFO] found external [-packer-default-plugin-name-] builders from qemu plugin
2023/04/11 20:13:04 [TRACE] Starting external plugin /home/zakaria/.config/packer/plugins/github.com/hashicorp/qemu/packer-plugin-qemu_v1.0.9_x5.0_linux_amd64 start builder -packer-default-plugin-name-
2023/04/11 20:13:04 Starting plugin: /home/zakaria/.config/packer/plugins/github.com/hashicorp/qemu/packer-plugin-qemu_v1.0.9_x5.0_linux_amd64 []string{"/home/zakaria/.config/packer/plugins/github.com/hashicorp/qemu/packer-plugin-qemu_v1.0.9_x5.0_linux_amd64", "start", "builder", "-packer-default-plugin-name-"}
2023/04/11 20:13:04 Waiting for RPC address for: /home/zakaria/.config/packer/plugins/github.com/hashicorp/qemu/packer-plugin-qemu_v1.0.9_x5.0_linux_amd64
2023/04/11 20:13:04 packer-plugin-qemu_v1.0.9_x5.0_linux_amd64 plugin: 2023/04/11 20:13:04 Plugin address: unix /tmp/packer-plugin309220793
2023/04/11 20:13:04 packer-plugin-qemu_v1.0.9_x5.0_linux_amd64 plugin: 2023/04/11 20:13:04 Waiting for connection...
2023/04/11 20:13:04 Received unix RPC address for /home/zakaria/.config/packer/plugins/github.com/hashicorp/qemu/packer-plugin-qemu_v1.0.9_x5.0_linux_amd64: addr is /tmp/packer-plugin309220793
2023/04/11 20:13:04 packer-plugin-qemu_v1.0.9_x5.0_linux_amd64 plugin: 2023/04/11 20:13:04 Serving a plugin connection...
2023/04/11 20:13:04 packer-plugin-qemu_v1.0.9_x5.0_linux_amd64 plugin: 2023/04/11 20:13:04 [TRACE] starting builder -packer-default-plugin-name-
2023/04/11 20:13:04 packer-plugin-qemu_v1.0.9_x5.0_linux_amd64 plugin: 2023/04/11 20:13:04 use specified accelerator: kvm
2023/04/11 20:13:04 [TRACE] Starting internal plugin packer-provisioner-shell
2023/04/11 20:13:04 Starting plugin: /usr/bin/packer []string{"/usr/bin/packer", "plugin", "packer-provisioner-shell"}
2023/04/11 20:13:04 Waiting for RPC address for: /usr/bin/packer
2023/04/11 20:13:05 packer-provisioner-shell plugin: [INFO] Packer version: 1.8.6 [go1.20.1 linux amd64]
2023/04/11 20:13:05 packer-provisioner-shell plugin: Detected xdg config directory from env var: /home/zakaria/.config
2023/04/11 20:13:05 packer-provisioner-shell plugin: [INFO] PACKER_CONFIG env var not set; checking the default config file path
2023/04/11 20:13:05 packer-provisioner-shell plugin: [INFO] PACKER_CONFIG env var set; attempting to open config file: /home/zakaria/.packerconfig
2023/04/11 20:13:05 packer-provisioner-shell plugin: [WARN] Config file doesn't exist: /home/zakaria/.packerconfig
2023/04/11 20:13:05 packer-provisioner-shell plugin: Detected xdg config directory from env var: /home/zakaria/.config
2023/04/11 20:13:05 packer-provisioner-shell plugin: [INFO] Setting cache directory: /home/zakaria/.cache/packer
2023/04/11 20:13:05 packer-provisioner-shell plugin: args: []string{"packer-provisioner-shell"}
2023/04/11 20:13:05 packer-provisioner-shell plugin: Detected xdg config directory from env var: /home/zakaria/.config
2023/04/11 20:13:05 packer-provisioner-shell plugin: Plugin address: unix /tmp/packer-plugin771583659
2023/04/11 20:13:05 packer-provisioner-shell plugin: Waiting for connection...
2023/04/11 20:13:05 Received unix RPC address for /usr/bin/packer: addr is /tmp/packer-plugin771583659
2023/04/11 20:13:05 packer-provisioner-shell plugin: Serving a plugin connection...
2023/04/11 20:13:05 Build debug mode: false
2023/04/11 20:13:05 Force build: false
2023/04/11 20:13:05 On error: 
2023/04/11 20:13:05 Waiting on builds to complete...
2023/04/11 20:13:05 Starting build run: qemu.rocky
2023/04/11 20:13:05 Running builder: 
2023/04/11 20:13:05 [INFO] (telemetry) Starting builder qemu.rocky
qemu.rocky: output will be in this color.

2023/04/11 20:13:05 packer-plugin-qemu_v1.0.9_x5.0_linux_amd64 plugin: 2023/04/11 20:13:05 Qemu path: /usr/bin/qemu-system-x86_64, Qemu Image path: /usr/bin/qemu-img
qemu.rocky: Retrieving ISO
qemu.rocky: Trying https://download.rockylinux.org/pub/rocky/9/isos/x86_64/Rocky-9.1-x86_64-minimal.iso
2023/04/11 20:13:05 packer-plugin-qemu_v1.0.9_x5.0_linux_amd64 plugin: 2023/04/11 20:13:05 Acquiring lock for: https://download.rockylinux.org/pub/rocky/9/isos/x86_64/Rocky-9.1-x86_64-minimal.iso?checksum=sha256%3A750c373c3206ae79784e436cc94fffc122296cf1bf8129a427dcd6ba7fac5888 (/home/zakaria/.cache/packer/8f4d630bc056b35e6243168c126713b9dad68ffd.iso.lock)
==> qemu.rocky: Trying https://download.rockylinux.org/pub/rocky/9/isos/x86_64/Rocky-9.1-x86_64-minimal.iso?checksum=sha256%3A750c373c3206ae79784e436cc94fffc122296cf1bf8129a427dcd6ba7fac5888
qemu.rocky: Rocky-9.1-x86_64-minimal.iso 412.40 KiB / 1.48 GiB [>-----------------------------------------------------------------------------------------------------------------------]   0.03% 5h25m58s
...
...
#+end_example
#+html: </details>

After the ISO file is downloded, an interface will pop up from which you can follow the automated installation.

---

Congratulations, you have built your first image using Packer!
